In [ ]:
===================== Data Analysis ===========================
1.pandas ------- dataframe read and write operations
2.numpy -------- numerical python math operations
3.matplotlib --- plots, graphs , visualization
4.seaborn ------ plots
5.plotly ------- plots
6.bokhe -------- plots

====================== Machine Learning ============================
7.sickit-learn(sklearn) ------ model development
8.stats packages ------------- linear regression

========================= webscrapping and database connections ==========
9.sqlite --------------- SQL connection
10.beautiful soup ------ scrap the data
11.wesocket ------------ scrap the data

=========================== Deep Learning =================================
12.tensorflow ------ deep learning models development (google)
13.keras ----------- 
14.pytorch --------- develop by facebook (meta)
15.opencv ---------- computer vision(reading and writin images)
16.pillow ---------- reading images

============================= NLP ==================================
17.NLTK ----------- natural language tool kit
18.spacy ---------- NLP models
19.wordcloud ------ 

========================== web development ==========================
20.flask
21.django
22.fast API
23.gradio

=========================== Apps creation ============================
24.streamlit

========================= Transformers BERT ==========================
25.transformers --------- huggingface(google)

================= pretrained models object detection ================
26.vg16
27.mobilenet
28.yolo --------- ultralytics

===================== NLP prestrained model ===========================
29.word2vec ------ google
30.glove --------- standforuniversity

========================= model save ==================================
31.pickel
32.joblib

========================= GenAI LLM ===================================
33.azure openAI
34.google Gemini
35.amazon bedrock
36.LLAMA meta AI
37.langchain Framework

======================= model deployment ===============================
38.mlflow

======================= cloud services ==================================
39.azure ML related packages
40.GCP vertex AI packages
41.amazon sagemaker packages

========================= Alle NLP ========================================
42.allen NLP packages

========================== ML using pyspark ===============================
43.MLlib package

========================== Small packages ================================
44.random
45.math
46.time
47.logger

In [ ]:
1.read the data
2.preprocess the data
3.EDA ---(pandas,numpy,matplotlib)
4.model development
    a. ML
    b. DL
        object detection
    c. NLP
    d. GenAI (langchain)
    e. pre trained
5.model evaluation
6.model tuning
7.model deployment

**step-1: import the packages**

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

**step-2: create a dataframe using list**

In [3]:
import pandas as pd
pd.DataFrame

pandas.core.frame.DataFrame

In [4]:
import pandas as pd
data=pd.DataFrame()
data
# we created a dataframe (no rows and no columns)
# we saved dataframe with name data

Empty DataFrame
Columns: []
Index: []

**step-3: provide the data**

In [5]:
name=['raj','abhi','chinna']
pd.DataFrame(name)

        0
0     raj
1    abhi
2  chinna

In [6]:
name=['raj','abhi','chinna']
age=[21,22,23]
pd.DataFrame(name,age)  # here age acts as index

         0
21     raj
22    abhi
23  chinna

In [7]:
name=['raj','abhi','chinna']
age=[21,22,23]
pd.DataFrame(zip(name,age))

        0   1
0     raj  21
1    abhi  22
2  chinna  23

In [8]:
name=['raj','abhi','chinna']
age=[21,22,23]
cls=['mca','msc','mba']
pd.DataFrame(zip(name,age,cls))

        0   1    2
0     raj  21  mca
1    abhi  22  msc
2  chinna  23  mba

In [9]:
name=['raj','abhi','chinna']
age=[21,22,23]
cls=['mca','msc','mba']
data=[name,age,cls]     #list in list
pd.DataFrame(data)

     0     1       2
0  raj  abhi  chinna
1   21    22      23
2  mca   msc     mba

In [10]:
name=['raj','abhi','chinna']
age=[21,22,23]
cls=['mca','msc','mba']
df=pd.DataFrame(zip(name,age,cls)) 
df

        0   1    2
0     raj  21  mca
1    abhi  22  msc
2  chinna  23  mba

**step-4: provide the columns**

- columns we need to provide in a list

- the number of columns exactly match with data

- here we have 3 columns, so we need to create list with 3 names

In [11]:
name=['raj','abhi','chinna']
age=[21,22,23]
cls=['mca','msc','mba']
#cols=['names','age','class']
df=pd.DataFrame(zip(name,age,cls),columns=['name','age','class']) 
df

     name  age class
0     raj   21   mca
1    abhi   22   msc
2  chinna   23   mba

In [12]:
name=['raj','abhi','chinna']
age=[21,22,23]
cls=['mca','msc','mba']
cols=['names','age','class']
df=pd.DataFrame(zip(name,age,cls),
                columns=cols) 
df

    names  age class
0     raj   21   mca
1    abhi   22   msc
2  chinna   23   mba

**step-5: provide the index**

In [13]:
name=['raj','abhi','chinna']
age=[21,22,23]
cls=['mca','msc','mba']
idx=['a','b','c']
cols=['names','age','class']
df=pd.DataFrame(zip(name,age,cls),
                index=idx,
                columns=cols) 
df

    names  age class
a     raj   21   mca
b    abhi   22   msc
c  chinna   23   mba

**Step-6: how to add a new column to already existed dataframe**
    
- here we already have dataframe with **df**

- it contains 3 columns

- now we want add a new column **marks**

- we need to create a new array or list

- that length of list should be equal to len of rows

- here we have 3 rows, so we new list also should have 3 values

In [14]:
# syntax
# df['<new column>']=<list>
df['marks']=[90,92,89]
df

    names  age class  marks
a     raj   21   mca     90
b    abhi   22   msc     92
c  chinna   23   mba     89

In [15]:
marks=[100,89,90]
df['Marks']=marks
df

    names  age class  marks  Marks
a     raj   21   mca     90    100
b    abhi   22   msc     92     89
c  chinna   23   mba     89     90

In [16]:
# creting data frame
names=['hari','ram','sam','sonu']
data=pd.DataFrame(names)
data

      0
0  hari
1   ram
2   sam
3  sonu

In [17]:
# adding data
names=['hari','ram','sam','sonu']
age=[21,22,23,20]
data=pd.DataFrame(zip(names,age))
data

      0   1
0  hari  21
1   ram  22
2   sam  23
3  sonu  20

In [18]:
# provide columns
names=['hari','ram','sam','sonu']
age=[21,22,23,20]
col=['name','age']
data=pd.DataFrame(zip(names,age),columns=col)
data

   name  age
0  hari   21
1   ram   22
2   sam   23
3  sonu   20

In [19]:
# adding extra column
data['marks']=[100,99,90,98]
data

   name  age  marks
0  hari   21    100
1   ram   22     99
2   sam   23     90
3  sonu   20     98

In [20]:
# provide index
names=['hari','ram','sam','sonu']
age=[21,22,23,20]
col=['name','age']
idx=[1,2,3,4]
data=pd.DataFrame(zip(names,age),columns=col,index=idx)
data

   name  age
1  hari   21
2   ram   22
3   sam   23
4  sonu   20

**step-7: create dataframe using empty dataframe**
    
- in above cases we created list 

- we  created a dataframe by passing tthe list in it

In [21]:
# empty dataframe is created
import pandas as pd
df1=pd.DataFrame()
df1

Empty DataFrame
Columns: []
Index: []

In [22]:
names=['hari','ram','sam','sonu']
age=[21,22,23,20]
city=['hyd','banglr','chennai','mumbai']
df1['name']=names
df1['age']=age
df1['city']=city
# df1(index=[1,2,3,4]) index can not be added in between
idx=[1,2,3,4]
df2=pd.DataFrame(df1,index=idx)
df2

   name   age     city
1   ram  22.0   banglr
2   sam  23.0  chennai
3  sonu  20.0   mumbai
4   NaN   NaN      NaN

**step-8: creating dataframe using dict**

In [23]:
dict1={'name':['hari','ram','sam','sonu'],
       'age':[21,22,23,20],
       'city':['hyd','banglr','chennai','mumbai']}
dict1

{'name': ['hari', 'ram', 'sam', 'sonu'],
 'age': [21, 22, 23, 20],
 'city': ['hyd', 'banglr', 'chennai', 'mumbai']}

In [24]:
df2=pd.DataFrame(dict1,index=[1,2,3,4])
df2

   name  age     city
1  hari   21      hyd
2   ram   22   banglr
3   sam   23  chennai
4  sonu   20   mumbai

- keys behave as columns

- values behave as rows

In [25]:
dict1={'names':'raj',
      'age':20,
      'city':'hyd'}
pd.DataFrame(dict1)

ValueError: If using all scalar values, you must pass an index

In [ ]:
dict1={'names':'raj',
      'age':20,
      'city':'hyd'}
pd.DataFrame(dict1,index=[1])

In [ ]:
dict1={'names':'raj',
      'age':20,
      'city':'hyd'}
pd.DataFrame(dict1,index=[1,2,3])

- data in the form of array

    - list : normal way
    
    - numpy : numpy package
    
    - tensor : tensorflow

In [26]:
l1=[1,2,3]
import numpy as np
np.array(l1)

array([1, 2, 3])

In [27]:
l1=[1,2,3]
l2=[4,5,6]
l1+l2

[1, 2, 3, 4, 5, 6]

In [28]:
l1=[1,2,3]
l2=[4,5,6]
l3=np.array(l1)
l4=np.array(l2)
l3+l4

array([5, 7, 9])

In [29]:
l1=[1,2,3]
l2=[4,5,6]
l1*l2

TypeError: can't multiply sequence by non-int of type 'list'

In [30]:
l1=[1,2,3]
l2=[4,5,6]
l3=np.array(l1)
l4=np.array(l2)
l3*l4

array([ 4, 10, 18])

**step-9: drop the column**

- in order to drop a column we need to use **drop** method

- all the methods based on your dtaframe name similar as string names

- it requires mainly 3 arguments

    - 1. column name
    
    - 2. axis 
    
        - axis=1 represent column
        
        - axis=0 represents rows
        
    - 3. inplace
        
        - once you drop column the dataframe affected
        
        - modified dataframe wants to save in same name or different name
        
        - if you want to keep at same name then **inplace= True**

In [31]:
dict2={'names':['sai','sonu','ram'],
      'age':[21,20,23],
      'college':['mvs','cmr','ou']}
dataf=pd.DataFrame(dict2,index=[1,2,3])
dataf

  names  age college
1   sai   21     mvs
2  sonu   20     cmr
3   ram   23      ou

In [32]:
dataf.drop(index=2)

  names  age college
1   sai   21     mvs
3   ram   23      ou

In [33]:
dict2={'names':['sai','sonu','ram'],
      'age':[21,20,23],
      'college':['mvs','cmr','ou']}
dataf=pd.DataFrame(dict2,index=[1,2,3])
dataf

  names  age college
1   sai   21     mvs
2  sonu   20     cmr
3   ram   23      ou

In [34]:
dataf.drop('age',axis=1,inplace=True)
dataf

  names college
1   sai     mvs
2  sonu     cmr
3   ram      ou

In [36]:
dict2={'names':['sai','sonu','ram'],
      'age':[21,20,23],
      'college':['mvs','cmr','ou']}
dataf=pd.DataFrame(dict2,index=[1,2,3])
dataf



dataf.drop('age',axis=0,inplace=True)
dataf

KeyError: "['age'] not found in axis"

In [37]:
import pandas as pd
dict2={'names':['sai','sonu','ram'],
      'age':[21,20,23],
      'college':['mvs','cmr','ou']}
dataf=pd.DataFrame(dict2,index=[1,2,3])
dataf

  names  age college
1   sai   21     mvs
2  sonu   20     cmr
3   ram   23      ou

In [38]:
new=dataf.drop(1,axis=0,inplace=False)
print(dataf)
print(new)

  names  age college
1   sai   21     mvs
2  sonu   20     cmr
3   ram   23      ou
  names  age college
2  sonu   20     cmr
3   ram   23      ou

**step-10: f\how to over write exsisted column data**
    
- we already have dataframe

- now we want to replace all values with specific column with new values

- first create list with new values

- then update column with new values , in the same way of how to create new column

- df[new col]=data ,  to create new column

- df[old col]=new data , to over wite old column

In [39]:
dict2={'names':['sai','sonu','ram'],
      'age':[21,20,23],
      'college':['mvs','cmr','ou']}
dataf=pd.DataFrame(dict2,index=[1,2,3])
dataf['college']=['ou','pu','jntu']
dataf

  names  age college
1   sai   21      ou
2  sonu   20      pu
3   ram   23    jntu

**step-11: how to save the dataframe**
    
- we can save dataframe using two ways

- csv (comma seperated value)

- excel

- for csv : .to_csv     extention = .csv

- for excel : .to_excel   excention = .xlsx

**save in csv format**

In [40]:
names=['hari','ram','sam','sonu']
age=[21,22,23,20]
col=['name','age']
data=pd.DataFrame(zip(names,age),columns=col)
data

   name  age
0  hari   21
1   ram   22
2   sam   23
3  sonu   20

In [41]:
# dataframe.method_name
# where you want to save
# name of file you want to save
data.to_csv('data.csv')

**excel**

In [42]:
data.to_excel('data1.xlsx')

**step-12: read the data**

    
- read_csv

- read_excel

- both are available on pandas

In [43]:
pd.read_csv('data.csv')

   Unnamed: 0  name  age
0           0  hari   21
1           1   ram   22
2           2   sam   23
3           3  sonu   20

In [44]:
pd.read_excel('data1.xlsx')

   Unnamed: 0  name  age
0           0  hari   21
1           1   ram   22
2           2   sam   23
3           3  sonu   20

**Step-13: how to avoid unnamed column**
    
- while we are saving the data, we have a argument name called index

- put index=False

In [45]:
names=['hari','ram','sam','sonu']
age=[21,22,23,20]
col=['name','age']
dataframe=pd.DataFrame(zip(names,age),columns=col)
dataframe

   name  age
0  hari   21
1   ram   22
2   sam   23
3  sonu   20

In [46]:
dataframe.to_csv('dataf.csv',index=False)

In [47]:
dataframe.to_excel('datafr.xlsx',index=False)

In [48]:
pd.read_csv('dataf.csv')

   name  age
0  hari   21
1   ram   22
2   sam   23
3  sonu   20

In [49]:
pd.read_excel('datafr.xlsx')

   name  age
0  hari   21
1   ram   22
2   sam   23
3  sonu   20

In [50]:
import pandas as pd

In [51]:
pd.read_csv(r'C:\Users\SONY\Desktop\assignments\data_Files\bank.csv',sep=';')

FileNotFoundError: [Errno 2] No such file or directory: 'C:\\Users\\SONY\\Desktop\\assignments\\data_Files\\bank.csv'

In [ ]:
visa_df=pd.read_csv(r'C:\Users\SONY\Desktop\assignments\data_Files\Visadataset.csv')
visa_df

In [52]:
# now onward we will work on visadataset same we should work on bank dataset

**head**

In [53]:
# dataframe name =visa_df
visa_df.head()  
# top five are seen

NameError: name 'visa_df' is not defined

**tail**

In [14]:
visa_df.tail()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.57,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.79,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.85,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.77,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.91,Year,Y,Certified

In [20]:
visa_df.tail(10)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
25470,EZYV25471,North America,Master's,Y,N,2272,1970,Northeast,516.4101,Hour,Y,Certified
25471,EZYV25472,Asia,High School,N,N,40224,1962,Island,75587.4200,Year,Y,Certified
25472,EZYV25473,Asia,High School,N,N,1346,2003,Midwest,76155.6000,Year,N,Certified
25473,EZYV25474,Asia,Bachelor's,Y,N,2421,2007,Northeast,22845.5600,Year,Y,Certified
25474,EZYV25475,Africa,Doctorate,N,N,2594,1979,Northeast,51104.7800,Year,Y,Certified
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

**shape**

In [21]:
visa_df.shape

(25480, 12)

In [22]:
print(f'the number of rows: {visa_df.shape[0]}')

the number of rows: 25480

In [23]:
print(f'the number of columns: {visa_df.shape[1]}')

the number of columns: 12

**size**

In [24]:
visa_df.size

305760

In [25]:
print(f'the number of values: {visa_df.size}')

the number of values: 305760

**column**

In [27]:
visa_df.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [28]:
type(visa_df.columns)

pandas.core.indexes.base.Index

In [30]:
list(visa_df.columns)

['case_id',
 'continent',
 'education_of_employee',
 'has_job_experience',
 'requires_job_training',
 'no_of_employees',
 'yr_of_estab',
 'region_of_employment',
 'prevailing_wage',
 'unit_of_wage',
 'full_time_position',
 'case_status']

In [31]:
len(visa_df.columns)

12

**data types**

In [29]:
visa_df.dtypes

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

- object means categorical column

**series vs dataframe**

- series looks like a dataframe but without column names

- dataframe means we have column names also

- series internally has dictionary

- dictionary has keys and values

In [15]:
type(visa_df.dtypes)

NameError: name 'visa_df' is not defined

In [38]:
dtypes=visa_df.dtypes
dtypes

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [39]:
list(dtypes)

[dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('int64'),
 dtype('int64'),
 dtype('O'),
 dtype('float64'),
 dtype('O'),
 dtype('O'),
 dtype('O')]

In [44]:
dtypes.keys()

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [ ]:
dtypes.values()

**task**

- create two list one is categorical column list and another numerical column list

In [43]:
for i,j in dtypes.items():
        print(i,j)

case_id object
continent object
education_of_employee object
has_job_experience object
requires_job_training object
no_of_employees int64
yr_of_estab int64
region_of_employment object
prevailing_wage float64
unit_of_wage object
full_time_position object
case_status object

In [46]:
for i,j in dtypes.items():
        if j=='object':
            print(i)

case_id
continent
education_of_employee
has_job_experience
requires_job_training
region_of_employment
unit_of_wage
full_time_position
case_status